Revit 2027 API
UIDocument.RefreshActiveView Method
Refresh the display of the active view in the active document.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void RefreshActiveView()
Public Sub RefreshActiveView
public:
void RefreshActiveView()
member RefreshActiveView : unit -> unit
See Also
Reference
UIDocument Class
Autodesk.Revit.UI Namespace